app/views/albums/show.html.erb

<h2>Tags</h2>
<% @album_item.tags.each do |t| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."album_id" = ?  [["album_id", 6]]