app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def sort
        params[:order].each do |key, value|
            Album.find(value[:id]).update(position: value[:position])