app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" ORDER BY position ASC
---
    def index
        @albums = Album.all

INSERT INTO "albums" ("title", "subtitle", "main_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ljslfjewr"], ["subtitle", "ljlwejrjer"], ["main_image", "http://placehold.it/480x320"], ["created_at", "2017-08-13 23:32:21.669457"], ["updated_at", "2017-08-13 23:32:21.669457"]]
---
    def create
        @album_item = Album.new(portfolio_params)

        respond_to do |format|
            if @album_item.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @album_item = Album.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def update
        @album_item = Album.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        @album_item = Album.find(params[:id])