app/controllers/blogs_controller.rb

  def index
    if logged_in?(:site_admin)
      @blogs = Blog.recent.page(params[:page]).per(5)
---
SELECT  "blogs".* FROM "blogs" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"

  def show
    if logged_in?(:site_admin) || @blog.published?
      @blog = Blog.includes(:comments).friendly.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = 1

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)  [["title", "dfsdfdsf"], ["body", "sfwerewrerer"], ["created_at", "2017-08-30 17:21:01.536111"], ["updated_at", "2017-08-30 17:21:01.536111"], ["slug", "dfsdfdsf"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = ?, "body" = ?, "topic_id" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "KB1 is NAUGHTY!!!"], ["body", "They're still my favorite though"], ["topic_id", 2], ["updated_at", "2017-09-05 06:17:51.772200"], ["id", 11]]

  def destroy
    @blog.destroy
---
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 12]]