app/controllers/blogs_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def edit
    @blog_item = Album.find(params[:id])