app/controllers/pages_controller.rb

  def home
    @posts = Blog.all
    @albums = Album.all
---
SELECT "blogs".* FROM "blogs"
SELECT "albums".* FROM "albums"