app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"

  def show
    @topic = Topic.find(params[:id])

    if logged_in?(:site_admin)
      @blogs = @topic.blogs.recent.page(params[:page]).per(5)
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."topic_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["topic_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."topic_id" = ?  [["topic_id", 3]]